{
	"name": "Constitutional Law I",
	"url": "",
	"facts": "",
	"issue": "",
	"ruling": "",
	"significance": "",
	"correlation": "",
	"enum1": "",
	"enum2": "",
	"enum3": "",
	"enum4": "",
	"enum5": "",
	"enum6": "",
	"enum7": "",
	"enum8": "",
	"details": "",
	"children": [
		{
			"name": "The Constitution",
			"url": "",
			"facts": "",
			"issue": "",
			"ruling": "",
			"significance": "",
			"correlation": "",
			"enum1": "",
			"enum2": "",
			"enum3": "",
			"enum4": "",
			"enum5": "",
			"enum6": "",
			"enum7": "",
			"enum8": "",
			"details": "",
			"children": [
				{
					"name": "De Leon vs. Esguerra",
					"url": "https://jurisprudence.tech/de-leon-v-esguerra/",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "Whether the 1987 Constitution took effect on February 2, 1987, the date that the plebiscite for its ratification was held or whether it took effect on February 11, 1987, the date its ratification was proclaimed per Proclamation No. 58 of the President of the Philippines, Corazon C. Aquino. The Court next holds as a consequence of its declaration at bar that the Constitution took effect on the date of its ratification in the plebiscite held on February 2, 1987, that: (1) the Provisional Constitution promulgated on March 25, 1986 must be deemed to have been superseded by the 1987 Constitution on the same date February 2, 1987 and (2) by and after said date, February 2, 1987, absent any saying clause to the contrary in the Transitory Article of the Constitution, respondent OIC Governor could no longer exercise the power to replace petitioners in their positions as Barangay Captain and Councilmen. Hence, the attempted replacement of petitioners by respondent OIC Governor’s designation on February 8, 1987 of their successors could no longer produce any legal force and effect.",
					"children": [
						{
							"name": "Proclamation No. 58, s. 1987",
							"details": "Proclaiming the ratification of the 1987 Constitution",
							"url": "https://www.officialgazette.gov.ph/1987/02/11/proclamation-no-58-s-1987-2/",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": ""
						}
					]
				},
				{
					"name": "Manila Prince Hotel vs. GSIS",
					"url": "https://jurisprudence.tech/manila-prince-hotel-v-gsis/",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "A constitution is a system of fundamental laws for the governance and administration of a nation. It is supreme, imperious, absolute and unalterable except by the authority from which it emanates. It has been defined as the fundamental and paramount law of the nation.  It prescribes the permanent framework of a system of government, assigns to the different departments their respective powers and duties, and establishes certain fixed principles on which government is founded. The fundamental conception in other words is that it is a supreme law to which all other laws must conform and in accordance with which all private rights must be determined and all public authority administered. ||| Under the doctrine of constitutional supremacy, if a law or contract violates any norm of the constitution that law or contract whether promulgated by the legislative or by the executive branch or entered into by private persons for private purposes is null and void and without any force and effect. Thus, since the Constitution is the fundamental, paramount and supreme law of the nation, it is deemed written in every statute and contract.",
					"children": [
						{
							"name": "Self-executing provision",
							"url": "https://jurisprudence.tech/manila-prince-hotel-v-gsis/",
							"details": "Self-executing provisions. A provision which lays down a general principle is usually not self-executing. But a provision which is complete in it self and becomes operative without the aid of supplementary or enabling legislation, or that which supplies a sufficient rule by means of which the right it grants may be enjoyed or protected, is self-executing. Thus, a constitutional provision is self-executing if the nature and extent of the right conferred and the liability imposed are fixed by the Constitution itself, so that they can be determined by an examination and construction of its terms, and there is no language indicating that the subject is referred to the legislature for action",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": ""
						}
					]
				},
				{
					"name": "Francisco vs. House of Representatives",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "The issue here is whether the filing of the second impeachment complaint against Chief Justice Hilario G. Davide, Jr. with the House of Representatives falls within the one year bar provided in the Constitution, and whether the resolution thereof is a political question.",
					"children": []
				}
			]
		},
		{
			"name": "Basic Concepts",
			"url": "",
			"facts": "",
			"issue": "",
			"ruling": "",
			"significance": "",
			"correlation": "",
			"enum1": "",
			"enum2": "",
			"enum3": "",
			"enum4": "",
			"enum5": "",
			"enum6": "",
			"enum7": "",
			"enum8": "",
			"details": "",
			"children": [
				{
					"name": "Separation of Powers",
					"url": "",
					"details": "The separation of powers is a fundamental principle in our system of government. It obtains not through express provision but by actual division in our Constitution. Each department of the government has exclusive cognizance of matters within its jurisdiction,… and is supreme within its own sphere. But it does not follow from the fact that the three powers are to be kept separate and distinct that the Constitution intended them to be absolutely unrestrained and independent of each other. The Constitution has provided for an… elaborate system of checks and balances to secure coordination in the workings of the various departments of the government. x x x And the judiciary in turn, with the Supreme Court as the final arbiter, effectively checks the other departments in the exercise of its… power to determine the law, and hence to declare executive and legislative acts void if violative of the Constitution.",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": ""
				},
				{
					"name": "Political Question",
					"url": "",
					"details": "Truly political questions are thus beyond judicial review, the reason for respect of the doctrine of separation of powers to be maintained. A Republican form of government rests on the conviction that sovereignty should reside in the people and that all government authority must emanate from them. It abhors the concentration of power on one or a few, cognizant that power, when absolute, can lead to abuse, but… it also shuns a direct and unbridled rule by the people, a veritable kindling to the passionate fires of anarchy.",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": ""
				}
			]
		},
		{
			"name": "Amendments and Revisions",
			"url": "",
			"facts": "",
			"issue": "",
			"ruling": "",
			"significance": "",
			"correlation": "",
			"enum1": "",
			"enum2": "",
			"enum3": "",
			"enum4": "",
			"enum5": "",
			"enum6": "",
			"enum7": "",
			"enum8": "",
			"details": "",
			"children": [
				{
					"name": "Gonzales vs. COMELEC",
					"url": "https://jurisprudence.tech/gonzales-v-comelec/",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "This case poses a question as to the validity of  RA. No. 4913 and R.B.H. No. 1 and 3 which aims to increase the number of the members of the House of Representatives, and to allow Congressmen and Senators become delegates to the constitutional convention without losing their seats in Congress.",
					"children": [
						{
							"name": "Article XV, Section 1",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "The Congress in joint session assembled by a vote of three-fourths of all the Members of the Senate and of the House of Representatives voting separately, may propose amendments to this Constitution or call a convention for that purpose. Such amendments shall be valid as part of this Constitution when approved by a majority of the votes cast at an election at which the amendments are submitted to the people for their ratification.",
							"url": "https://jurisprudence.tech/gonzales-v-comelec/"
						},
						{
							"name": "Justiciability of Issues on Constitutional Amendments",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "When proposing, as a constituent assembly, amendments to the Constitution, the members of Congress derive their authority from the Fundamental Law, it follows, necessarily, that they do not have the final say on whether or not their acts are within or beyond constitutional limits. Otherwise, they could brush aside and set the same at naught, contrary to the basic tenet that ours is a government of laws, not of men, and to the rigid nature of our Constitution. Such rigidity is stressed by the fact that, the Constitution expressly confers upon the Supreme Court,14 the power to declare a treaty unconstitutional,15 despite the eminently political character of treaty-making power. In short, the issue whether or not a Resolution of Congress — acting as a constituent assembly — violates the Constitution is essentially justiciable, not political, and, hence, subject to judicial review."
						}
					]
				},
				{
					"name": "Imbong vs. COMELEC",
					"url": "https://jurisprudence.tech/imbong-v-comelec/",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "RA 6132 is challenged for increasing the numbers of representatives for a Constitutional Assembly. The Court held that the provisions are constitutional. Congress has authority to call a constitutional convention as the constituent assembly. The Congress also has the authority to enact implementing details, contained in Res. Nos. 2 and 4 and R.A. 6132, since such details are within the competence of the Congress in the exercise of its legislative power.",
					"children": []
				},
				{
					"name": "Occena vs. COMELEC",
					"url": "https://jurisprudence.tech/occena-v-comelec/",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "This case questioned the validity of the Constitution on the grounds that the amendments proposed are so extensive in character that they go far beyond the limits of the authority conferred on the Interim Batasang Pambansa as Successor of the Interim National Assembly. The Court held that the issue whether the constitution is to be revised or amended would become immaterial the moment the same is ratified by the people.",
					"children": []
				},
				{
					"name": "Tolentino vs. COMELEC",
					"url": "https://jurisprudence.tech/tolentino-v-comelec/",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "The case questioned Organic Resolution No.1 which seeks to lower the voting age requirement to 18. The issue is whether or not this single amendment is proper for a plebicsite. The Court held that under Section 1, Article XV of the Constitution, the amendments should be submitted to the people not separately from but together with all the other amendments to be proposed by this present Convention.",
					"children": [
						{
							"name": "Doctrine of Proper Submission",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "Submission of piecemeal amendments is unconstitutional. All amendments must be submitted for ratification in one plebiscite only. The people have to be given a proper frame of reference in arriving at their decision.",
							"url": "https://jurisprudence.tech/tolentino-v-comelec/"
						}
					]
				},
				{
					"name": "Sanidad vs. COMELEC",
					"url": "https://jurisprudence.tech/sanidad-v-comelec/",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "These cases seeks to prohibit the COMELEC to conduct the Referendum Plebiscite which aims to continue martial law and to amend the Constitution. The Court held that the issue of whether the President can assume the power of a constituent assembly is a justiciable question since it is not the wisdom but the constitutional authority of the president to perform such act is in question. The president has the authority to propose amendments as the governmental powers are generally concentrated to the president in times of crisis. The time for deliberation of the referendum-plebiscite questions, 3 weeks, is not too short especially since the questions are issues of the day and the people have been living with them since the proclamation of martial law.",
					"children": [
						{
							"name": "Distinction between Plebscite and Referendum",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "It is apt to distinguish here between a referendum and a plebiscite. A referendum is merely consultative in character. It is simply a means of assessing public reaction to the given issues submitted to the people foe their consideration, the calling of which is derived from or within the totality of the executive power of the President. It is participated in by all citizens from the age of fifteen, regardless of whether or not they are illiterates, feeble-minded, or ex- convicts. A plebiscite, on the other hand, involves the constituent act of those 'citizens of the Philippines not otherwise disqualified by law, who are eighteen years of age or over, and who shall have resided in the Philippines for at least one year and in the place wherein they propose to vote for at least six months preceding the election Literacy, property or any other substantive requirement is not imposed. It is generally associated with the amending process of the Constitution, more particularly, the ratification aspect."
						}
					]
				},
				{
					"name": "Province of Cotabato vs. The Gov’t. of the RP Peace Panel on Ancestral Domain",
					"url": "https://jurisprudence.tech/prov-of-cotabato-v-the-govt-of-the-rp-peace-panel-on-ancestral-domain/",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "Subject of these consolidated cases is the extent of the powers of the President in pursuing the peace process. The MOA-AD is declared contrary to law and the Constitution. While the MOA-AD would not amount to an international agreement or unilateral declaration binding on the Philippines under international law, respondents’ act of guaranteeing amendments is, by itself, already a constitutional violation that renders the MOA-AD fatally defective.",
					"children": []
				},
				{
					"name": "Santiago vs. COMELEC",
					"url": "https://jurisprudence.tech/santiago-v-comelec/",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "The issue in this case stems from the Petition for Initiative on the Constitution on the basis of R.A. No. 6735. The Court declared that R.A. No. 6735 is inadequate to cover the system of initiative on amendments to the Constitution. It has failed to provide sufficient standard for subordinate legislation as there only mere mention of the Constitutional Amendment and thereby failing to comply with  the “completeness” and the “sufficient standard” tests",
					"children": [
						{
							"name": "Delegation",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"url": "https://jurisprudence.tech/santiago-v-comelec/",
							"details": "The rule is that what has been delegated, cannot be delegated or as expressed in a Latin maxim: potestas delegata non delegari potest. However, in every case of permissible delegation, there must be a showing that the delegation itself is valid. It is valid only if the law (a) is complete in itself, setting forth therein the policy to be executed, carried out, or implemented by the delegate; and (b) fixes a standard — the limits of which are sufficiently determinate and determinable — to which the delegate must conform in the performance of his functions. A sufficient standard is one which defines legislative policy, marks its limits, maps out its boundaries and specifies the public agency to apply it. It indicates the circumstances under which the legislative command is to be effected.",
							"children": [
								{
									"name": "Exceptions",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"enum1": "(1) Delegation of tariff powers to the President under Section 28(2) of Article VI of the Constitution;",
									"enum2": "(2) Delegation of emergency powers to the President under Section 23(2) of Article VI of the Constitution;",
									"enum3": "(3) Delegation to the people at large;",
									"enum4": "(4) Delegation to local governments;",
									"enum5": "(5) Delegation to administrative bodies. ",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"url": "https://jurisprudence.tech/santiago-v-comelec/",
									"details": "The recognized exceptions to the rule are as follows:",
									"children": [
										{
											"name": "Sufficiency and Completeness Test",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"enum1": "(a) is complete in itself, setting forth therein the policy to be executed, carried out, or implemented by the delegate;",
											"enum2": "(b) fixes a standard — the limits of which are sufficiently determinate and determinable — to which the delegate must conform in the performance of his functions. A sufficient standard is one which defines legislative policy, marks its limits, maps out its boundaries and specifies the public agency to apply it. It indicates the circumstances under which the legislative command is to be effected.",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"url": "https://jurisprudence.tech/santiago-v-comelec/",
											"details": "Empowering the COMELEC, an administrative body exercising quasi-judicial functions, to promulgate rules and regulations is a form of delegation of legislative authority under no. 5 above. However, in every case of permissible delegation, there must be a showing that the delegation itself is valid. It is valid only if the law:",
											"children": []
										}
									]
								}
							]
						}
					]
				},
				{
					"name": "Lambino vs. COMELEC",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "The issue in this case si whether Lambino and his group complied with the requirements of the law in introducing revisions to the Constitution. The Court held that they did not. The phrase “directly proposed by the people through initiative upon a petition” – means that the draft of the proposed constitutional amendment should be ready and shown to the people before they sign such proposal. Before they sign the proposal, a draft must already been shown to them. The entire proposal on its face is a petition by the people. Moreover, initiatives may only introduce amendments and not revisions to the Constitution.",
					"children": [
						{
							"name": "Distinction: Amendment v. Revision",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"url": "https://jurisprudence.tech/lambino-v-comelec/",
							"details": "Revision– broadly implies a change that alters a basic principle in the Constitution. (E.g. altering the principles of separation of powers or the system of checks and balances) If the change alters the substantial entirety of the Constitution, as when the change affects substantial provisions of the Constitution. ||| Amendment– broadly refers to a change that adds, reduces or deletes without altering the basic principle involved. ||| Revision, generally affects several provisions of the Constitution. Amendment, generally affects only the specific provision being amended."
						}
					]
				},
				{
					"name": "Article XVII",
					"url": "https://jurisprudence.tech/article-xvii-amendments-or-revisions/",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "Section 1. Any amendment to, or revision of, this Constitution may be proposed by:(1) The Congress, upon a vote of three-fourths of all its Members; or (2) A constitutional convention.",
					"enum2": "Section 2. Amendments to this Constitution may likewise be directly proposed by the people through initiative upon a petition of at least twelve per centum of the total number of registered voters, of which every legislative district must be represented by at least three per centum of the registered voters therein. No amendment under this section shall be authorized within five years following the ratification of this Constitution nor oftener than once every five years thereafter. The Congress shall provide for the implementation of the exercise of this right. ",
					"enum3": "Section 3. The Congress may, by a vote of two-thirds of all its Members, call a constitutional convention, or by a majority vote of all its Members, submit to the electorate the question of calling such a convention. ",
					"enum4": "Section 4. Any amendment to, or revision of, this Constitution under Section 1 hereof shall be valid when ratified by a majority of the votes cast in a plebiscite which shall be held not earlier than sixty days nor later than ninety days after the approval of such amendment or revision. Any amendment under Section 2 hereof shall be valid when ratified by a majority of the votes cast in a plebiscite which shall be held not earlier than sixty days nor later than ninety days after the certification by the Commission on Elections of the sufficiency of the petition.",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "AMENDMENTS OR REVISIONS",
					"children": []
				},
				{
					"name": "Republic Act No. 6735",
					"url": "https://jurisprudence.tech/ra-6735-the-initiative-and-referendum-act-2/",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "Declared as Inadequate by the Supreme Court in Santiago v. COMELEC for Initiative on the Constitution.",
					"children": []
				}
			]
		},
		{
			"name": "Concept of the State",
			"facts": "",
			"issue": "",
			"ruling": "",
			"significance": "",
			"correlation": "",
			"enum1": "",
			"enum2": "",
			"enum3": "",
			"enum4": "",
			"enum5": "",
			"enum6": "",
			"enum7": "",
			"enum8": "",
			"url": "",
			"details": "",
			"children": [
				{
					"name": "Article I",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "The national territory comprises the Philippine archipelago, with all the islands and waters embraced therein, and all other territories over which the Philippines has sovereignty or jurisdiction, consisting of its terrestrial, fluvial and aerial domains, including its territorial sea, the seabed, the subsoil, the insular shelves, and other submarine areas. The waters around, between, and connecting the islands of the archipelago, regardless of their breadth and dimensions, form part of the internal waters of the Philippines.",
					"children": [
						{
							"name": "Mode of Acquiring Territory",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "(1) Prescription ",
							"enum2": "(2) Accretion",
							"enum3": "(3) Cession",
							"enum4": "(4) Occupation",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "",
							"children": []
						}
					]
				},
				{
					"name": "Collector of Internal Revenue vs. Campos Rueda",
					"url": "https://jurisprudence.tech/cir-v-campos-rueda/",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "The expression “foreign country,” was used in the last proviso of section 122 of NIRC refers to a government of that foreign power which although not an international person in the sense of international law does not impose transfer or death upon intangible person properties of our citizens not residing therein whose law allow a similar exemption from such taxes. It is therefore not necessary that Tangier should have been recognized by our government in order to entitle the respondent to the exemption benefits of the proviso of said section 122 of our tax code.",
					"children": [
						{
							"name": "Definition of State",
							"url": "https://jurisprudence.tech/cir-v-campos-rueda/",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "STATE is a community of persons, more or less numerous, permanently occupying a definite portion of territory, independent of external control, and possessing a government to which a great body of inhabitants render habitual obedience.",
							"children": []
						}
					]
				},
				{
					"name": "Magallona vs. Ermita",
					"url": "https://jurisprudence.tech/magallona-v-ermita/",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "Dean Magallona challenges the baseline law (RA 9522) in its implementation of the UNCLOS III of 1984",
					"children": [
						{
							"name": "Doctrine 1",
							"url": "https://jurisprudence.tech/magallona-v-ermita/",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "UNCLOS III has nothing to do with the acquisition or loss of territory. It is a multilateral treaty regulating sea-use rights over maritime zones, contiguous zones, and continental shelves that UNCLOS III delimits. Baseline laws such as R.A. No. 9522 are enacted by the State parties to mark out specific basepoints along their coasts from which baselines are drawn, either straight or contoured, to serve as geographic staring points to measure the breadth of the maritime zones and continental shelf. ",
							"children": []
						},
						{
							"name": "Doctrine 2",
							"url": "https://jurisprudence.tech/magallona-v-ermita/",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "R.A. No. 9522 and UNCLOS III are not incompatible with the Constitution’s delineation of internal waters. The Philippines still exercises sovereignty over these waters under UNCLOS III. The political branches of the Philippine Government, in the competent discharge of their constitutional powers, may pass legislation designating routes within the archipelagic waters to regulate innocent and sea passage.",
							"children": []
						}
					]
				},
				{
					"name": "South China Sea",
					"url": "https://jurisprudence.tech/magallona-v-ermita/",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "R.A. No. 9522 and UNCLOS III are not incompatible with the Constitution’s delineation of internal waters. The Philippines still exercises sovereignty over these waters under UNCLOS III. The political branches of the Philippine Government, in the competent discharge of their constitutional powers, may pass legislation designating routes within the archipelagic waters to regulate innocent and sea passage.",
					"children": []
				},
				{
					"name": "Bacani vs. NACOCO",
					"url": "https://jurisprudence.tech/bacani-v-nacoco/",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "NACOCO is not considered a government entity and is not exempted from paying the stenographers’ fees under Rule 130 of the Rules of Court.",
					"children": [
						{
							"name": "Definition of Government",
							"url": "https://jurisprudence.tech/bacani-v-nacoco/",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "That institution or aggregate of institutions by which an independent society makes and carries out those rules of action which are necessary to enable men to live in a social state, or which are imposed upon the people forming that society by those who possess the power or authority of prescribing them.",
							"children": []
						},
						{
							"name": "Functions of Government",
							"url": "https://jurisprudence.tech/bacani-v-nacoco/",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "Defined by US President Wilson",
							"children": [
								{
									"name": "Constituent Functions",
									"url": "https://jurisprudence.tech/bacani-v-nacoco/",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"enum1": "(1) The keeping of order and providing for the protection of persons and property from violence and robbery. ",
									"enum2": "(2) The fixing of the legal relations between man and wife and between parents and children. ",
									"enum3": "(3) The regulation of the holding, transmission, and interchange of property, and the determination of its liabilities for debt or for crime. ",
									"enum4": "(4) The determination of contract rights between individuals.",
									"enum5": "(5) The definition and punishment of crime.",
									"enum6": "(6) The administration of justice in civil cases. ",
									"enum7": "(7) The determination of the political duties, privileges, and relations of citizens. ",
									"enum8": "(8) Dealings of the state with foreign powers: the preservation of the state from external danger or encroachment and the advancement of its international interests.’ ",
									"details": "  ",
									"children": []
								},
								{
									"name": "Ministrant Functions",
									"url": "https://jurisprudence.tech/bacani-v-nacoco/",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"enum1": "(1) that a government should do for the public welfare those things which private capital would not naturally undertake and",
									"enum2": "(2) that a government should do these things which by its very nature it is better equipped to administer for the public welfare than is any private individual or group of individuals.",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"details": "The most important of the ministrant functions are: public works, public education, public charity, health and safety regulations, and regulations of trade and industry. The principles deter mining whether or not a government shall exercise certain of these optional functions are:  ",
									"children": []
								}
							]
						}
					]
				},
				{
					"name": "Philippine Virginia Tobacco Adm. Vs. CIR",
					"url": "https://jurisprudence.tech/pvta-v-cir/",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "Correlated to: State Immunity",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "The distinction between Constitute and Ministrant functions had become blurred. The growing complexities of modern society have rendered this traditional classification of the function of the government quite unrealistic, not to say obsolete. ",
					"children": []
				},
				{
					"name": "Gov. of the Philippine Islands vs. Monte de Piedad",
					"url": "https://jurisprudence.tech/government-of-phils-islands-v-monte-de-piedad/",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "The legislature or government of the State, as parens patriae, has the right to enforce all charities of public nature. The great body of municipal law which regulates private and domestic rights continue in force until they are abrogated or changed by the new ruler.  As such, the government has the authority to file a suit on behalf of its people by virtue of the principle of parens patriae.",
					"children": [
						{
							"name": "Doctrine of Parens Patriae",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "Literally, parent of the people. As such, the government may act as guardian of the rights of the  people who may be disadvantaged or suffering from some disability or misfortune",
							"children": []
						}
					]
				},
				{
					"name": "Co Kim Cham vs. Valdez Tan Keh ",
					"url": "https://jurisprudence.tech/co-kim-chan-v-valdez-tan-keh/",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "During belligerent occupation, judicial decisions rendered by the invader continue its force and effect even after the cessation of the invasion. ",
					"children": [
						{
							"name": "Principle of Postliminium",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "",
							"children": [
								{
									"name": "Peralta v Director Of Prisons",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"details": "At the end of the occupation, when the occupant is ousted from the territory, the political laws which had been suspended during the occupation shall automatically become effective again",
									"children": []
								},
								{
									"name": "Macariola v. Asuncion",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"details": "Political laws of the belligerent occupants are automatically abrogated, unless they are expressly re-enacted by the affirmative act of the new sovereign. Municipal laws remain in force. Municipal laws which are inconsistent with those of the occupied territory require a proclamation to be declared inoperative",
									"children": []
								}
							]
						},
						{
							"name": "Three Kinds of De Facto Government",
							"url": "https://jurisprudence.tech/bacani-v-nacoco/",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "(1) by force or democracy, ",
							"enum2": "(2) by paramount force - by invading force, ",
							"enum3": "(3) by insurrection - by inhabitants of territory",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "",
							"children": [
								{
									"name": "Instances where De Facto Government May Suspend Municipal Laws",
									"url": "https://jurisprudence.tech/bacani-v-nacoco/",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"details": "",
									"children": []
								}
							]
						}
					]
				},
				{
					"name": "People vs. Gozo",
					"url": "https://jurisprudence.tech/people-v-gozo/",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "Under the terms of the Agreement between the Philippines and the United States, The Philippine Government has not abdicated its sovereignty over the bases as part of the Philippine territory or divested itself completely of jurisdiction over offenses committed therein. The United States Government has prior or preferential but not exclusive jurisdiction of such offenses. Jurisdiction of the Philippines over the military bases may be diminished but it does not disappear. ",
					"children": [
						{
							"name": "DOCTRINE OF AUTO-LIMITATION",
							"url": "https://jurisprudence.tech/people-v-gozo/",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "It is the doctrine wherein the Philippines adheres to the exercise of its sovereignty. It means that any state may, by its consent, express or implied, submit to a restriction of its sovereign rights (Reagan v. CIR).",
							"children": []
						},
						{
							"name": "Characteristics of Sovereignty (PECIII)",
							"url": "https://jurisprudence.tech/people-v-gozo/",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "(1) Inalienable ",
							"enum2": "(2) Permanent ",
							"enum3": "(3) Exlclusive ",
							"enum4": "(4) Comprehensive ",
							"enum5": "(5) Imprescriptible ",
							"enum6": "(6) Indivisible",
							"enum7": "",
							"enum8": "",
							"details": "",
							"children": []
						}
					]
				},
				{
					"name": "Laurel vs. Misa",
					"url": "https://jurisprudence.tech/laurel-v-misa/",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "The absolute and permanent allegiance of the inhabitants of a territory occupied by the enemy of their legitimate government on the sovereign is not abrogated or severed by the enemy occupation because the sovereignty of the government or sovereign de jure is not transferred to the occupier. ",
					"children": [
						{
							"name": "Definition of Sovereignty",
							"url": "https://jurisprudence.tech/laurel-v-misa/",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "The supreme and uncontrollable power inherent in a State by which that State is governed",
							"children": []
						}
					]
				},
				{
					"name": "Ruffy vs. Chief of Staff  ",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "The suspension of political laws during belligerent occupation does not apply to the enemies in arms.",
					"children": []
				},
				{
					"name": "Preamble",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "We, the sovereign Filipino people, imploring the aid of Almighty God, in order to build a just and humane society, and establish a Government that shall embody our ideals and aspirations, promote the common good, conserve and develop our patrimony, and secure to ourselves and our posterity, the blessings of independence and democracy under the rule of law and a regime of truth, justice, freedom, love, equality, and peace, do ordain and promulgate this Constitution.",
					"children": []
				}
			]
		},
		{
			"name": "State Immunity",
			"facts": "",
			"issue": "",
			"ruling": "",
			"significance": "",
			"correlation": "",
			"enum1": "",
			"enum2": "",
			"enum3": "",
			"enum4": "",
			"enum5": "",
			"enum6": "",
			"enum7": "",
			"enum8": "",
			"url": "",
			"details": "Basis: Par in parem non habet imperium",
			"children": [
				{
					"name": "Notes",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "NOTE TO ME: There is a need to categorize these cases as to the subject of immunity from suit.",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "",
					"children": [
						{
							"name": "Immunity may be invoked even on for the first time in appeal",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "Courts have judicial notice of the immunity of the state.",
							"children": []
						},
						{
							"name": "Sociological Basis of State Immunity",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"details": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"children": []
						},
						{
							"name": "Suability not = to Liability",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"details": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"children": []
						},
						{
							"name": "Kinds of Express Waiver",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"details": "",
							"enum1": "1) General Law - corporation code",
							"enum2": "2) Special Law",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"children": []
						},
						{
							"name": "Kinds of Incorporated ",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"details": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"children": []
						}
					]
				},
				{
					"name": "Kinds of Impled Waiver",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"details": "",
					"enum1": "1) When the State Enters into a Contract",
					"enum2": "2) When the State Initiates an Action",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"children": []
				},
				{
					"name": "Section 3, Article XVI",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "The State may not be sued without its consent.",
					"children": []
				},
				{
					"name": "Sanders vs. Veridiano",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "Does state immunity extend to its officers? ",
					"children": [
						{
							"name": "Even if the Case is filed in the Officer's Personal Liability",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"details": "Immunity still prevails when ultimate liability falls to the ",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"children": []
						}
					]
				},
				{
					"name": "Republic vs. Sandoval",
					"url": "",
					"facts": "mendiola massacre",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "Acts of the president cannot be construed as waiver of the immunity from suit.",
					"children": []
				},
				{
					"name": "Festejo vs. Fernando",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "new doctrine in Amigable v. Cuenca",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "Action of public officer who acted beyond or without authority can only be result in personal liabilty. -abandoned doctrine.",
					"children": []
				},
				{
					"name": "United States vs. Guinto",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "WAIVER  OF  STATE   IMMUNITY.     The  consent  of   the  state  to  be  sued  may be manifested  expressly  or impliedly.  Express consent may be embodied  in a general law or a special  law.  Consent is  implied  when the state enters into  a contract or it itself commences litigation.",
					"children": [
						{
							"name": "Act 3083",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"details": "The general  law waiving the  immunity  of  the state  from suit  is  found  in Act  No. 3083,  under  which the  Philippine government consents and submits  to be sued upon   any   moneyed   claim  involving  liability  arising   from  contract,  express  or implied,  which could  serve as a basis  of  civil  action  between private  parties.",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"children": []
						},
						{
							"name": "Various Contracts in this case",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"details": "",
							"enum1": "barbershop",
							"enum2": "wharves",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"children": []
						}
					]
				},
				{
					"name": "Veterans Manpower & Protective Services",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "",
					"children": []
				},
				{
					"name": "Merritt vs. Government of Philippine Islands",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "a special law was passed to enable a person to sue the government for an alleged tort. When the government enters into a contract, it  is  deemed to have descended to the level of the other contracting party and divested of its sovereign immunity from suit with its implied consent. Waiver is also implied when the government files a complaint, thus opening itself to a counterclaim.",
					"children": [
						{
							"name": "",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"details": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"children": []
						}
					]
				},
				{
					"name": "Amigable vs. Cuenca",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "Festejo v. Fernando",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "",
					"children": [
						{
							"name": "When can the Government be Sued without its Consent",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "(1) when an act is unconstitional ",
							"enum2": "(2) when consent has already been given by law === recheck coz you only heard this in class",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "",
							"children": []
						}
					]
				},
				{
					"name": "Republic vs. Sandiganbayan  ",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "PCGG and ill-gotten wealth",
					"children": [
						{
							"name": "Immunity by the Government when it Initiates an action",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"details": "There is an implied waiver of immunity when the state initiates an action. The State is, of course, immune from suit in the sense that it cannot, as a rule, be sued without its consent. But it is axiomatic that in filing an action, it divests itself of its sovereign character and sheds its immunity from suit, descending to the level of an ordinary litigant. The PCGG cannot claim a superior or preferred status to the State, even while assuming to represent or act for the State.",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"children": []
						}
					]
				},
				{
					"name": "China National Machinery & Equipment vs. Santamaria ",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "When the state enters into a a contract with an arbitration clause - not an implied waiver. In the absence of evidence to the contrary, foreign laws on a particular subject are presumed to be the same as those of the Philippines, and following the most intelligent assumption we can gather, GTZ is akin to a governmental owned or controlled corporation without original charter which, by virtue of the Corporation Code, has expressly consented to be sued. ",
					"children": []
				},
				{
					"name": "Republic vs. Feliciano",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "Courts have judicial notice of the immunity of the state.",
					"children": []
				},
				{
					"name": "United States vs. Ruiz",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "",
					"children": []
				},
				{
					"name": "The Holy See vs. Rosario",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": " ",
					"children": [
						{
							"name": "PROCEDURE IN INVOKING STATE IMMUNITY BY FOREIGN STATES.",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"details": "In the Philippines, the practice is for the foreign government or the international organization to first secure an executive endorsement of its claim of sovereign or diplomatic immunity. But how the Philippine Foreign Office conveys its endorsement to the courts varies: ",
							"enum1": "In International Catholic Migration Commission v. Calleja, 190 SCRA 130 (1990), the Secretary of Foreign Affairs just sent a letter directly to the Secretary of Labor and Employment, informing the latter that the respondent employer could not be sued because it enjoyed diplomatic immunity.",
							"enum2": "In World Health Organization v. Aquino, 48 SCRA 242 (1972), the Secretary of Foreign Affairs sent the trial court a telegram to that effect. ",
							"enum3": "In Baer v. Tizon, 57 SCRA 1 (1974), the U.S. Embassy asked the Secretary of Foreign Affairs to request the Solicitor General to make, in behalf of the Commander of the United States Naval Base at Olongapo City, Zambales, a 'suggestion' to respondent Judge. The Solicitor General embodied the 'suggestion' in a Manifestation and Memorandum as amicus curiae.  ",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"children": []
						},
						{
							"name": "Remedy when the Foreign State Successfully Invokes State Immunity",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"details": "Philippine Government can lobby for the individual. It can file an action before an international tribunal.",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"children": []
						},
						{
							"name": "Conflicting Theories of State Immunity",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"details": "",
							"enum1": "1) Classical Theory",
							"enum2": "2) Restrictive Theory - applies when the state enters into a commercial contracts",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"children": []
						},
						{
							"name": "Considerations in Determining if a Contract is Governmental or Proprietal",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"details": "",
							"enum1": "1) Nature of Contract",
							"enum2": "2) Regular Course of Business or Isolated Transaction",
							"enum3": "3) Objective of the State in Entering into the Contract - to derive profit or to comply with sovereign duties",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"children": []
						}
					]
				},
				{
					"name": "Republic vs. Villasor",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "Funds cannot be garnished.",
					"children": []
				},
				{
					"name": "Department of Agriculture vs. NLRC ",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "Public funds cannot be subject to garnishment.",
					"children": []
				},
				{
					"name": "PNB vs. Pabalan  ",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "",
					"children": []
				},
				{
					"name": "Rayo vs. CFI of Bulacan  ",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "",
					"children": []
				},
				{
					"name": "Bureau of Printing vs. Bureau of Printing Employees Ass. ",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "Applicable only if the claimant or plaintiff performs the entire activity such as in this case where the persons involved are employees.",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "Unincorporated government agency performing incidental/occassional commercial transactions may still invoke state immunity. The agency is still mainly performing governmental functions. It has not divested itself of immunity.",
					"children": []
				},
				{
					"name": "Mobil Phils. Exploration vs. Customs Arrastre Service ",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "The activities of customs are 100% commercial in nature. However, the functions are indispensable to the functions of the Bureau of Customs. Hence, it still enjoys immunity from suit.",
					"children": [
						{
							"name": "",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"details": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"children": []
						}
					]
				},
				{
					"name": "Civil Aeronautics Administration vs. CA ",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "",
					"children": []
				},
				{
					"name": "Air Transportation Administration vs. Spouses David ",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "",
					"children": []
				},
				{
					"name": "Mun. of San Fernando vs. Firme ",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "",
					"children": [
						{
							"name": "When is a government acting through a special agent?",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"details": "The government is exercising commercial function.",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"children": []
						}
					]
				},
				{
					"name": "Mun. of San Miguel vs. Fernandez ",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "Earmarked funds. It is the settled doctrine of the law that not only the public property but also the taxes and public revenues of such corporations cannot be seized under execution against them, either in the treasury or when in transit to it. Judgments rendered for taxes, and the proceeds of such judgments in the hands of officers of the law, are not subject to execution unless so declared by statute.",
					"children": []
				},
				{
					"name": "Mun. of Makati vs. CA ",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "",
					"children": []
				},
				{
					"name": "City of Caloocan vs. Judge Allarde ",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"details": "However, the rule is not absolute and admits of a well defined exception, that is, when there is a corresponding appropriation as required  by  law. Otherwise stated, the rule on the immunity of public funds from  seizure or  garnishment  does not apply where the funds sought to be levied under execution are already allocated by law specifically for the satisfaction of the money judgment against the government. In such a case, the monetary judgment may be legally  enforced by judicial processes.",
					"children": []
				}
			]
		},
		{
			"name": "Fundamental Principles and State Policies",
			"url": "",
			"facts": "",
			"issue": "",
			"ruling": "",
			"significance": "",
			"correlation": "",
			"enum1": "",
			"enum2": "",
			"enum3": "",
			"enum4": "",
			"enum5": "",
			"enum6": "",
			"enum7": "",
			"enum8": "",
			"details": "",
			"children": [
				{
					"name": "Distinctions between Fundemantal Principles and State Policy",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"details": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"children": []
				},
				{
					"name": "Principles",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"details": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"children": [
						{
							"name": "SECTION 1",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "The Philippines is a democratic and republican State. Sovereignty resides in the people and all government authority emanates from them.",
							"children": [
								{
									"name": "Villavicencio v. Lukban",
									"url": "",
									"facts": "One hundred and seventy women, who had lived in the segregated district for women of ill repute in the city of Manila, were by orders of the Mayor of the city of anila and the chief of police of that city isolated from society and then at night, without their consent and without any opportunity to consult with friends or to defend their rights, were forcibly hustled on board steamers for transportation to regions unknown. No law, order, or regulation authorized the Mayor of the city of Manila or the chief of the police of that city to force citizens of the Philippine Islands to change their domicile from Manila to another locality.      ",
									"issue": "",
									"ruling": "That the writ of habeas corpus was properly granted, and that the Mayor of the city of Manila who was primarily responsible for the deportation, is in contempt of court for his failure to comply with the order of the court.  These women, despite their being in a sense lepers of society, are nevertheless not chattles, but Philippine citizens protected by the same constitutional guaranties as are other citizens. The very idea that one man may be compelled to hold his life, or the means of living, or any material right essential to the enjoyment of life, at the mere will of another, seems to be intolerable in any country where freedom prevails, as being the essence of slavery itself. (Yick Wo vs. Hopkins [1886], 118 U.S., 356, 370.) All this explains the motive in issuing the writ of habeas corpus, and makes clear why we said in the very beginning that the primary question was whether the courts should permit a government of men or a government of laws to be established in the Philippine Islands.",
									"significance": "",
									"correlation": "",
									"details": " “Government of laws and not of men”",
									"enum1": "No official, no matter how high, is above the law. The courts are the forum which functionate to safeguard individual liberty and to punish official transgressors. ",
									"enum2": "The law is the only supreme power in our system of government, and every man who by accepting office participates in its functions is only the more strongly bound to submit to that supremacy, and to observe the limitations which it imposes upon the exercise of the authority which it gives.",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": [
										{
											"name": "Characteristics of a Republican Government",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "",
											"enum1": "1) Government of Law and Not of Men",
											"enum2": "2) Accountability of Public Officers",
											"enum3": "3) Rule of the Majortiy",
											"enum4": "4) Bill of Rights",
											"enum5": "5) Legislature cannot enact irrepealable laws",
											"enum6": "6) Separation of Powers",
											"enum7": "",
											"enum8": "",
											"children": []
										}
									]
								}
							]
						},
						{
							"name": "SECTION 2",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "The Philippines renounces war as an instrument of national policy, adopts the generally accepted principles of international law as part of the law of the land and adheres to the policy of peace, equality, justice, freedom, cooperation, and amity with all nations.",
							"children": [
								{
									"name": "Three Policies in Section 2",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "",
									"enum1": "1) renounces war as an instrument of national policy",
									"enum2": "2) adopts the generally accepted principles of international law as part of the law of the land",
									"enum3": "3) adheres to the policy of peace, equality, justice, freedom, cooperation, and amity with all nations",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": [
										{
											"name": "Notes",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "",
											"enum1": "Only covers aggressive war. Defensive war is not prohibited because it is a duty of state.",
											"enum2": "Covers international armed conflict. Does not include domestic armed conflict.",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										},
										{
											"name": "How International Law Becomes Part of the Land",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "",
											"enum1": "Incorporation - international law becomes part of the land upon constitutional declaration",
											"enum2": "Transformation - international law is transformed to a domestic law through a constitutional mechanism such as local legislation. There must be a positive act on part of the government",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										},
										{
											"name": "Sources of International Law",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "Article 38(1) of the Statute of the International Court of Justice (ICJ)",
											"enum1": "1) treaties and conventions",
											"enum2": "2) international custom",
											"enum3": "3) general principles of law recognized by civilized nations",
											"enum4": "4) judicial decisions and teachings",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										}
									]
								},
								{
									"name": "Poe-Llamanzares vs. COMELEC",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "Foundlings are likewise citizens under international law. Under the 1987 Constitution, an international law can become part of the sphere of domestic law either by transformation or incorporation. The transformation method requires that an international law be transformed into a domestic law through a constitutional mechanism such as local legislation.124 On the other hand, generally accepted principles of international law, by virtue of the incorporation clause of the Constitution, form part of the laws of the land even if they do not derive from treaty obligations. Generally accepted principles of international law include international custom as evidence of a general practice accepted as law, and general principles of law recognized by civilized nations.125 International customary rules are accepted as binding as a result from the combination of two elements: the established, widespread, and consistent practice on the part of States; and a psychological element known as the opinionjuris sive necessitates (opinion as to law or necessity). Implicit in the latter element is a belief that the practice in question is rendered obligatory by the existence of a rule of law requiring it.126 General principles of law recognized by civilized nations are principles established by a process of reasoning or judicial logic, based on principles which are basic to legal systems generally,such as general principles of equity, i.e., the general principles of fairness and justice, and the general principle against discrimination which is embodied in the Universal Declaration of Human Rights, the International Covenant on Economic, Social and Cultural Rights, the International Convention on the Elimination of All Forms of Racial Discrimination, the Convention Against Discrimination in Education, the Convention (No. 111) Concerning Discrimination in Respect of Employment and Occupation. These are the same core principles which underlie the Philippine Constitution itself, as embodied in the due process and equal protection clauses of the Bill of Rights.",
									"significance": "",
									"correlation": "",
									"details": "Generally Accepted Principles of International Law - On Foundlings",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": [
										{
											"name": "International customary rules",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "International customary rules are accepted as binding as a result from the combination of two elements:",
											"enum1": "1) the established, widespread, and consistent practice on the part of States;",
											"enum2": "2) a psychological element known as the opinionjuris sive necessitates (opinion as to law or necessity). Implicit in the latter element is a belief that the practice in question is rendered obligatory by the existence of a rule of law requiring it.",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										},
										{
											"name": "General principles of law recognized by civilized nations",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "are principles 'established by a process of reasoning' or judicial logic, based on principles which are 'basic to legal systems generally,' such as 'general principles of equity, i.e., the general principles of fairness and justice,' and the 'general principle against discrimination' which is embodied in the 'Universal Declaration of Human Rights, the International Covenant on Economic, Social and Cultural Rights, the International Convention on the Elimination of All Forms of Racial Discrimination, the Convention Against Discrimination in Education, the Convention (No. 111) Concerning Discrimination in Respect of Employment and Occupation.'",
											"enum1": "These are the same core principles which underlie the Philippine Constitution itself, as embodied in the due process and equal protection clauses of the Bill of Rights.",
											"enum2": "",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										}
									]
								},
								{
									"name": "Kuroda vs. Jalandoni ",
									"url": "",
									"facts": "Petitioner  argues that  respondent Military  Commission  has  no jurisdiction  to try petitioner for acts committed in violation of  the Hague Convention and the Geneva Convention  because the Philippines is  not a signatory  to the first  and signed  the second  only  in 1947.  ",
									"issue": "",
									"ruling": "It  cannot  be  denied  that the rules  and regulations  of  the Hague and Geneva conventions  form part of  and are wholly based  on the generally accepted principles  of  international  law.  In fact,  these rules  and principles  were accepted by  the two belligerent  nations,  the United  States  and Japan, who were signatories  to the two Conventions.  Such rules  and principles,  therefore,  form part of   the   law  of   our  nation  even  if  the   Philippines  was  not  a  signatory  to  the conventions  embodying  them,  for our Constitution  has been deliberately  general and extensive  in  its  scope and  is  not  confined  to the  recognition  of   rules  and principles of international law as contained in treaties to which our government may have been or shall be a signatory. ",
									"significance": "",
									"correlation": "",
									"details": "War crimes - Jurisdiction of Military Commission to Try violations of the Hague Conventions",
									"enum1": "Generally accepted principles of international law form part of the law of our nation even if the Philippines was not a signatory to the conventions embodying them for our Constitution has been deliberately general and extensive in its scope and is not confined to the recognition of rules and principles of international law as contained in treaties to which our government may have been or shall be a signatory.",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								},
								{
									"name": "Agustin vs. Edu",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "Early Warning Devices",
									"enum1": "It is not for this country to repudiate a commitment to which it had pledged its word. The concept of pacta sunt servanda stands in the way of such an attitude, which is at war with the principle of international morality.",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": [
										{
											"name": "Transformation by a Letter of Instruction",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "There are other means of transformation of international law into domestic law, and not merely through legislative enactment.",
											"enum1": "",
											"enum2": "",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
											}
									]
								},
								{
									"name": "Ichong vs. Hernandez",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "TREATIES SUBJECT TO QUALIFICATION OR AMENDMENT BY SUBSEQUENT LAW. — The law does not violate international treaties and obligations. The United Nations Charter imposes no strict or legal obligations regarding the rights and freedom of their subjects, and the Declaration of Human Rights contains nothing more than a mere recommendation, or a common standard of achievement for all peoples and all nations. The Treaty of Amity between the Republic of the Philippines and the Republic of China of April 18, 1947 guarantees equality of treatment to the Chinese nationals  ‘upon the same terms as the nationals of any other country ‘. But the nationals of China are not discriminated against because nationals of all other countries, except those of the United States, who are granted special rights by the Constitution, are all Prohibited from engaging in the retail trade. But even supposing that the law infringes upon the said treaty, the treaty is always subject to qualification or amendment by a subsequent law, and the same may never curtail or restrict the scope of the police power of the State.",
									"significance": "",
									"correlation": "",
									"details": "Retail Trade",
									"enum1": "Even supposing that the law infringes upon the said treaty, the treaty is always subject to qualification or amendment by a subsequent law and the same may never curtail or restrict the scope of the police power of the State.",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								},
								{
									"name": "Gonzales vs. Hechanova",
									"url": "",
									"facts": "It is lastly contended that the Government of the Philippines has already entered into two (2) contracts for the purchase of rice, one with the Republic of Vietnam, and another with the Government of Burma; that these contracts constitute valid executive agreements under international law; that such agreements became binding and effective upon signing thereof by representatives of the parties thereto; that in case of conflict between Republic Acts Nos. 2207 and 3452 on the one hand, and the aforementioned contracts, on the other, the latter should prevail, because, if a treaty and a statute are inconsistent with each other, the conflict must be resolved — under the American jurisprudence — in favor of the one which is latest in point of time; that petitioner herein assails the validity of acts of the executive relative to foreign relations in the conduct of which the Supreme Court cannot interfere; and that the aforementioned contracts have already been consummated, the Government of the Philippines having a ready paid the price of the rice involved therein through irrevocable letters of credit in favor of the sellers of said commodity. ",
									"issue": "",
									"ruling": "We find no merit in this pretense. The Court is not satisfied that the status of said contracts as alleged executive agreements has been sufficiently established. The parties to said contracts do not appear to have regarded the same as executive agreements. But, even assuming that said contracts may properly be considered as executive agreements, the same are unlawful, as well as null and void, from a constitutional viewpoint, said agreements being inconsistent with the provisions of Republic Acts Nos. 2207 and 3452. Although the President may, under the American constitutional system, enter into executive agreements without previous legislative authority, he may not, by executive agreement, enter into a transaction which is prohibited by statutes enacted prior thereto. Under the Constitution, the main function of the Executive is to enforce laws enacted by Congress. The former may not interfere in the performance of the legislative powers of the latter, except in the exercise of his veto power. He may not defeat legislative enactments that ha e acquired the status of laws, by indirectly repealing the same through an executive agreement providing for the performance of the very act prohibited by said laws. The American theory to the effect that, in the event of conflict between a treaty and a statute, the one which is latest in point of time shall prevail, is not applicable to the case at bar, for respondents not only admit, but, also, insist that the contracts adverted to are not treaties. Said theory may be justified upon the ground that treaties to which the United States is signatory require the advice and consent of its Senate, and, hence, of a branch of the legislative department. No such justification can be given as regards executive agreements not authorized by previous legislation, without completely upsetting the principle of separation of powers and the system of checks and balances which are fundamental in our constitutional set up and that of the United States.",
									"significance": "",
									"correlation": "",
									"details": "Spanish Lawyer",
									"enum1": "Although the President may enter into executive agreements without previous legislative authority, he may not, by executive agreement, enter into a transaction which is prohibited by statutes enacted prior thereto.",
									"enum2": "Our Constitution authorizes the nullification of a treaty, not only when it conflicts with the fundamental law, but, also, when it runs counter to an act of Congress.",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								},
								{
									"name": "In Re: Garcia",
									"url": "",
									"facts": "Spanish Lawyer",
									"issue": "",
									"ruling": "At any rate, the Treaty was intended to govern Filipino citizens desiring to practice their profession in Spain, and the citizens of Spain desiring to practice their professions in the Philippines. Applicant is a Filipino citizen desiring to practice the legal profession in the Philippines. He is therefore subject to the laws of his own country and is not entitled to the privileges extended to Spanish nationals desiring to practice in the Philippines. ",
									"significance": "",
									"correlation": "",
									"details": "The aforementioned Treaty, concluded between the Republic of the Philippines and the Spanish State could not have been intended to modify the laws and regulations governing admission to the practice of law in the Philippines, for the reason that the Executive Department may not encroach upon the constitutional prerogative of the Supreme Court to promulgate rules for admission to the practice of law in the Philippines, the power to repeal, alter or supplement such rules being reserved only to the Congress of the Philippines. (See Sec. 13, Art. VIII, Phil. Constitution).",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								}
							]
						},
						{
							"name": "SECTION 3",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"details": "Civilian authority is, at all times, supreme over the military. The Armed Forces of the Philippines is the protector of the people and the State. Its goal is to secure the sovereignty of the State and the integrity of the national territory.",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"children": []
						},
						{
							"name": "SECTION 4",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "The prime duty of the Government is to serve and protect the people. The Government may call upon the people to defend the State and, in the fulfillment thereof, all citizens may be required, under conditions provided by law, to render personal military or civil service.",
							"children": [
								{
									"name": "People v. Lagman",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "COMPULSORY MILITARY SERVICE IS CONSTITUTIONAL. The National Defense Law, in so far as it establishes compulsory military service, does not go against this constitutional provision but is, on the contrary, in faithful compliance therewith. The duty of the Government to defend the State cannot be performed except through an army. To leave the organization of an army to the will of the citizens would be to make this duty of the Government excusable should there be no sufficient men who volunteer to enlist therein. In the United States, the courts have held in a series of decisions that the compulsory military service adopted by reason of the civil war and the world war does not violate the Constitution, because the power to establish it is derived from that granted to Congress to declare war and to organize and maintain an army. This is so because the right of the Government to require compulsory military service is a consequence of its duty to defend the State and is reciprocal with its duty to defend the life, liberty, and property of the citizen. In the case of Jacobson vs. Massachusetts, it was said that, without violating the Constitution, a person may be compelled by force, if need be, against his will, against his pecuniary interests, and even against his religious or political convictions, to take his place in the ranks of the army of this country, and risk the chance of being shot down in its defense. In the case of United States vs. Olson, it was also said that this is not deprivation of property without due process of law, because, in its just sense, there is no right of property to an office or employment. The circumstance that these decisions refer to laws enacted by reason of the actual existence of war does not make our case any different, inasmuch as, in the last analysis, what justifies compulsory military service is the defense of the State, whether actual or whether in preparation to make it more effective, in case of need.",
									"significance": "",
									"correlation": "",
									"details": "Military Service",
									"enum1": "a. To leave the organization of an army to the will of the citizens would be to make this duty of the Government excusable should there be nosufficient men who volunteer to enlist therein.",
									"enum2": "b. The right of the Government to require compulsory military service is a consequence of its duty to defend the State and is reciprocal with its duty to defend the life, liberty and property of the citizen. What justifies compulsory military service is the defense of the State, whether actual or whether in preparation to make it more effective, in case of need.",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								}
							]
						},
						{
							"name": "SECTION 5",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"details": "The maintenance of peace and order, the protection of life, liberty, and property, and the promotion of the general welfare are essential for the enjoyment by all the people of the blessings of democracy.",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"children": []
						},
						{
							"name": "SECTION 6",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "The separation of Church and State shall be inviolable.",
							"children": [
								{
									"name": "Principle of Separation of Church and State",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "It means that the State should not use its money and coercive power to establish religion. It should not support a particular religion. The State is prohibited from interfering with purely ecclesiastical affairs. The church is likewise prohibited from meddling in purely secular affairs. But it does not mean that there is total or absolute separation. The better rule is symbiotic relations between the church and State. ",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								},
								{
									"name": "Other Constitutional Provisions Evidencing the Separation of Church and State",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": [
										{
											"name": "Sec. 28 [3], Art. Vi, 1987 Constitution",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "Charitable institutions, churches and parsonages or convents appurtenant thereto, mosques, non-profit cemeteries, and all lands, buildings, and improvements, actually, directly, and exclusively used for religious, charitable, or educational purposes shall be exempt from taxation",
											"enum1": "",
											"enum2": "",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										},
										{
											"name": "Sec. 29[2],Art. VI, 1987 Constitution",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "No public money or property shall be appropriated, applied, paid, or employed, directly or indirectly, for the use, benefit, or support of any sect, church, denomination, sectarian institution, or system of religion, or of any priest, preacher, minister, or other religious teacher, or dignitary as such, except when such priest, preacher, minister or dignitary is assigned to the armed forces, or to any penal institution, or government orphanage or leprosarium",
											"enum1": "",
											"enum2": "",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										},
										{
											"name": "Sec. 3[3], Art XIV, 1987 Constitution",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "At the option expressed in writing by the parents or guardians, religion  shall be allowed to be taught to their children or wards without additional cost to the Government.",
											"enum1": "",
											"enum2": "",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										}
									]
								},
								{
									"name": "Aglipay vs. Ruiz",
									"url": "",
									"facts": "The petitioner,  Mons.  Gregorio Aglipay,  Supreme Head  of the Philippine Independent Church, seeks the issuance from this court of a writ of prohibition to prevent the respondent Director of Posts from issuing and  selling  postage  stamps  commemorative  of  the  Thirty-third International Eucharistic Congress. In May, 1936, the Director of Posts announced in the dailies of  Manila  that  he  would  order  the  issuance  of  postage  stamps commemorating the celebration in the City of Manila of the Thirty- third International  Eucharistic  Congress,  organized  by  the  Roman  Catholic Church.  In spite of the protest of the petitioner's attorney, the respondent publicly announced having sent to the United States the designs  of the postage for printing ",
									"issue": " Is there a violation of principle of separation of church and state?",
									"ruling": "In the case at bar, it appears that the respondent Director of Posts issued the postage stamps in question under the provisions of Act. No. 4052 of the Philippine Legislature. Act No. 4052 contemplates no religious purpose in view. What it gives the Director of Posts is the discretionary power to determine when the issuance of special postage stamps would be ‘advantageous to Government’ does not authorize the violation of the Constitution. It does not authorize the appropriation, use or application of public money or property for the use, benefit or support of a particular sect or church. In the present case, however, the issuance of the postage stamps in question by the Director of Posts and the Secretary of Public Works and Communications was not inspired by any sectarian feeling to favor a particular church or religious denominations. The stamps were not issued and sold for the benefit of the Roman Catholic Church. Nor were money derived from the sale of the stamps giv n to that church. On the contrary, it appears from the letter of the Director of Posts of June 5, 1936, incorporated on page 2 of the petitioner's complaint, that the only purpose in issuing and selling the stamps was ‘to advertise the Philippines and attract more tourists to this country.’ The officials concerned merely took advantage of an event considered of international importance ‘to give publicity to the Philippines and its people’. It is significant to note that the stamps as actually designed and printed, instead of showing a Catholic Church chalice as originally planned, contains a map of the Philippines and the location of the City of Manila, and an inscription as follows: ‘Seat XXXIII International Eucharistic Congress, Feb. 3-7, 1937.’ What is emphasized is not the Eucharistic Congress itself but Manila, the capital of the Philippines, as the seat of that congress. It is obvious that while the issuance and sale of the stamps in question may be said to be inseparably linked with an event of a religious character, the resulting propaganda, if any, received by the Roman Catholic Church, was not the aim and purpose of the Government. We are of the opinion that the Government should not be embarrassed in its activities simply because of incidental results, more or less religious in character, if the purpose had in view is one which could legitimately be undertaken by appropriate legislation. The main purpose should not be frustrated by its subordination to mere incidental results not contemplated. There is no violation of the principle of separation of church and state. The issuance and sale of the stamps in question maybe said to be separably linked with an event of a religious character, the resulting propaganda, if any, received by the Catholic Church, was not the aim and purpose of the government (to promote tourism).",
									"significance": "",
									"correlation": "",
									"details": "Stamps for Tourism",
									"enum1": "What is guaranteed by our Constitution is religious liberty, not mere religious toleration. ",
									"enum2": " Religion is a profession of faith to an active power that binds and elevates man to his Creator.",
									"enum3": "The Government should not be embarrassed in its activities simply because of incidental results, more or less religious in character, if the purpose had in view is one which could legitimately be undertaken by appropriate legislation.",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": [
										{
											"name": "Concessions to Religious Instiututions",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "",
											"enum1": "Our Constitution and laws exempt from taxation properties devoted exclusively to religious purposes (sec. 14, subsec. 3, Art. VI, Constitution of the Philippines and sec. 1, subsec. Ordinance appended thereto; Assessment Law, sec. 344, par [c], Adm. Code) ",
											"enum2": "Sectarian aid is not prohibited when a priest, preacher, minister or other religious teacher or dignitary as such is assigned to the armed forces or to any penal institution, orphanage or leprosarium (sec. 13, subsec. 3 Art. VI, Constitution of the Philippines). ",
											"enum3": "Optional religious instruction in the public schools is by constitutional mandate allowed (sec. 5, Art. XIII, Constitution of the Philippines, in relation to sec. 928, Ad. Code). ",
											"enum4": "Thursday and Friday of Holy Week, Thanksgiving Day, Christmas Day, and Sundays are made legal holidays (sec. 29, Adm. Code) because of the secular idea that their observance is conducive to beneficial moral results",
											"enum5": "The law allows divorce but punishes polygamy and bigamy; and certain crimes against religious worship are considered crimes against the fundamental laws of the state (see arts. 132 and 133, Revised Penal Code).",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										}
									]
								},
								{
									"name": "Garces vs. Estenzo",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "Fiesta",
									"enum1": "If there is nothing unconstitutional or illegal in holding a fiesta and having a patron saint for the barrio, then any activity intended to facilitate the worship of the patron saint cannot be branded as illegal.",
									"enum2": "Not every governmental activity which involves the expenditure of public funds and which has some religious tint is violative of the constitutional provisions regarding separation of church and state, freedom of worship and banning the use of public money or property.",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								},
								{
									"name": "Taruc vs. De la Cruz",
									"url": "",
									"facts": "Petitioners were lay members of the Philippine Independent Church  (PIC). On June 28, 1993,  Due to petitioners’  adamant  drive to create dissension within the diocese by celebrating their own open mass without  participation from the parish priest, Bishop de la Cruz declared petitioners  expelled/excommunicated  from  the  Philippine  Independent Church. The good Bishop did so as a last resort, as he first pleaded to the petitioners’ to cease from  riling  up the community  against  the diocese. Because  of  the order  of  expulsion/excommunication,  petitioners  filed  a complaint  for damages  with preliminary  injunction  against  Bishop  de la Cruz before the Regional Trial Court. They contended that their expulsion was illegal because it was done without trial thus violating their right to due process of law.",
									"issue": "INTRAMURAL RELIGIOUS ACTIVITIES. The only issue to be resolved in this case is whether or not the courts have jurisdiction to hear a case involving the expulsion/excommunication of members of a religious institution.",
									"ruling": "We rule that the courts do not. The expulsion/excommunication of members of a religious institution/organization is a matter best left to the discretion of the officials, and the laws and canons, of said institution/organization. It is not for the courts to exercise control over church authorities in the performance of their discretionary and official functions. Rather, it is for the members of religious institutions/organizations to conform to just church regulations. All who unite themselves to an ecclesiastical body do so with an implied consent to submit to the Church government and they are bound to submit to it.",
									"significance": "",
									"correlation": "",
									"details": "Excommunication",
									"enum1": "a. In a form of government where the complete separation of civil and ecclesiastical authority is insisted upon, the civil courts must not allow themselves to intrude unduly in matters of an ecclesiastical nature. ",
									"enum2": "b. In disputes involving religious institutions or organizations, there is one area which the Court should not touch: doctrinal and disciplinary differences.",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								},
								{
									"name": "Estrada vs. Escritor",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "“Declaration of Pledging Faithfulness”",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": [
										{
											"name": "Non-Theistic View (from US Jurisprudence",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "It has been proposed that basically, a creed must meet four criteria to qualify as religion under the First Amendment. ",
											"enum1": "First, there must be belief in God or some parallel belief that occupies a central place in the believers’ life.",
											"enum2": "Second, the religion must involve a moral code transcending individual belief, i.e., it cannot be purely subjective. ",
											"enum3": "Third, a demonstrable sincerity in belief is necessary, but the court must not inquire into the truth or reasonableness of the belief.",
											"enum4": "Fourth, there must be some associational ties, although there is also a view that religious beliefs held by a single person rather than being part of the teachings of any kind of group or sect are entitled to the protection of the Free Exercise Clause. ",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										},
										{
											"name": "Lemon Test",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "The Lemon test requires a challenged policy to meet the following criteria to pass scrutiny under the Establishment Clause:",
											"enum1": "(1) The statute must have a secular legislative purpose;",
											"enum2": "(2) Its primary or principal effect must be one that neither advances nor inhibits religion; and",
											"enum3": "(3) The statute must not foster an excessive entanglement with religion.",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										},
										{
											"name": "Approaches in Jurisprudence to the Walls of Separation",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "",
											"enum1": "",
											"enum2": "",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": [
												{
													"name": "Strict Separation",
													"url": "",
													"facts": "",
													"issue": "",
													"ruling": "",
													"significance": "",
													"correlation": "",
													"details": "The Strict Separationist believes that the Establishment Clause was meant to protect the state from the church, and the state’s hostility towards religion allows no interaction between the two.",
													"enum1": "",
													"enum2": "",
													"enum3": "",
													"enum4": "",
													"enum5": "",
													"enum6": "",
													"enum7": "",
													"enum8": "",
													"children": []
												},
												{
													"name": "Strict Neutrality",
													"url": "",
													"facts": "",
													"issue": "",
													"ruling": "",
													"significance": "",
													"correlation": "",
													"details": "The strict neutrality approach is not hostile to religion, but it is strict in holding that religion may not be used as a basis for classification for purposes of governmental action, whether the action confers rights or privileges or imposes duties or obligations. Only secular criteria may be the basis of government action.",
													"enum1": "",
													"enum2": "",
													"enum3": "",
													"enum4": "",
													"enum5": "",
													"enum6": "",
													"enum7": "",
													"enum8": "",
													"children": []
												},
												{
													"name": "Benevolent Neutrality/Accommodation",
													"url": "",
													"facts": "",
													"issue": "",
													"ruling": "",
													"significance": "",
													"correlation": "",
													"details": "",
													"enum1": "Unlike the Jeffersonian wall that is meant to protect the state from the church, the wall is meant to protect the church from the state.",
													"enum2": "",
													"enum3": "",
													"enum4": "",
													"enum5": "",
													"enum6": "",
													"enum7": "",
													"enum8": "",
													"children": [
														{
															"name": "Note on Benevolent Neutrality",
															"url": "",
															"facts": "",
															"issue": "",
															"ruling": "",
															"significance": "",
															"correlation": "",
															"details": "The adoption of the benevolent neutrality-accommodation approach does not mean that the Court ought to grant exemptions every time a free exercise claim comes before it.",
															"enum1": "Benevolent neutrality could allow for accommodation of morality based on religion, provided it does not offend compelling state interests.",
															"enum2": "",
															"enum3": "",
															"enum4": "",
															"enum5": "",
															"enum6": "",
															"enum7": "",
															"enum8": "",
															"children": [
																{
																	"name": "Compelling State Interest Test – 3 Questions",
																	"url": "",
																	"facts": "",
																	"issue": "",
																	"ruling": "",
																	"significance": "",
																	"correlation": "",
																	"details": "",
																	"enum1": "(1) “Has the statute or government action created a burden on the free exercise of religion?”",
																	"enum2": "(2) “Is there a sufficiently compelling state interest to justify this infringement of religious liberty?”",
																	"enum3": "(3) “Has the state in achieving its legitimate purposes used the least intrusive means possible so that the free exercise is not infringed any more than necessary to achieve the legitimate goal of the state?”",
																	"enum4": "",
																	"enum5": "",
																	"enum6": "",
																	"enum7": "",
																	"enum8": "",
																	"children": []
																}
															]
														}
													]
												}
											]
										},
										{
											"name": "Kinds of Accomodation in a Free Exercise Claim",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "A free exercise claim could result to three kinds of accommodation:",
											"enum1": "(1) Those which are found to be constitutionally compelled, i.e., required by the Free Exercise Clause",
											"enum2": "(2) Those which are discretionary or legislative, i.e., not required by the Free Exercise Clause but nonetheless permitted by the Establishment Clause;",
											"enum3": "(3) Those which the religion clauses prohibit.",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": [
												{
													"name": "Accomodation in the Philippines",
													"url": "",
													"facts": "",
													"issue": "",
													"ruling": "",
													"significance": "",
													"correlation": "",
													"details": "While there is no Philippine case as yet wherein the Court granted an accommodation/exemption to a religious act from the application of general penal laws, permissive accommodation based on religious freedom has been granted with respect to one of the crimes penalized under the Revised Penal Code, that of bigamy.",
													"enum1": "",
													"enum2": "",
													"enum3": "",
													"enum4": "",
													"enum5": "",
													"enum6": "",
													"enum7": "",
													"enum8": "",
													"children": []
												}
											]
										}
									]
								}
							]
						}
					]
				},
				{
					"name": "State Polices",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"details": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"children": [
						{
							"name": "SECTION 10",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "The State shall promote social justice in all phases of national development.",
							"children": [
								{
									"name": "Calalang vs. Williams",
									"url": "",
									"facts": "",
									"issue": "Whether the rules & regulations promulgated prohibiting animal drawn vehicles in certain streets of Manila pursuant to the provisions of Commonwealth Act No. 548 considered as constitutional? ",
									"ruling": "Yes. Said Act, by virtue of which the rules and regulations complained of were promulgated, aims to promote safe transit upon and avoid obstructions on national roads, in the interest and convenience of the public. In enacting said law, therefore, the National Assembly was prompted by considerations of public convenience and welfare. It was inspired by a desire to relieve congestion of traffic. which is, to say the least, a menace to public safety. Public welfare, then, lies at the bottom of the enactment of said law, and the state in order to promote the general welfare may interfere with personal liberty, with property, and with business and occupations. Persons and property may be subjected to all kinds of restraints and burdens, in order to secure the general comfort, health, and prosperity of the state ",
									"significance": "",
									"correlation": "",
									"details": "",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": [
										{
											"name": "Definition of Social Justice",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "Social justice is 'neither communism, nor despotism, nor atomism, nor anarchy,' but the humanization of laws and the equalization of social and economic forces by the State so that justice in its rational and objectively secular conception may at least be approximated. Social justice means the promotion of the welfare of all the people, the adoption by the Government of measures calculated to insure economic stability of all the competent elements of society, through the maintenance of a proper economic and social equilibrium in the interrelations of the members of the community, constitutionally, through the adoption of measures legally justifiable, or extra- constitutionally, through the exercise of powers underlying the existence of all governments on the time-honored principle of salus populi est suprema lex.   ",
											"enum1": "",
											"enum2": "",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": [
												{
													"name": "Notes on Social Justice",
													"url": "",
													"facts": "",
													"issue": "",
													"ruling": "",
													"significance": "",
													"correlation": "",
													"details": "",
													"enum1": "Social justice must be founded on the recognition of the necessity of interdependence among the diverse units of a society and of the protection  that should be equally and evenly extended to all groups as a combined force in our social and economic life, consistent with the fundamental and paramount objective of the state of promoting the health, comfort, and quiet of all persons, and of bringing about 'the greatest good to the greatest number.'",
													"enum2": "The promotion of social justice is to be achieved not through a mistaken sympathy towards any given group.",
													"enum3": "",
													"enum4": "",
													"enum5": "",
													"enum6": "",
													"enum7": "",
													"enum8": "",
													"children": []
												}
											]
										}
									]
								},
								{
									"name": "Almeda vs. CA",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "Share tenants",
									"enum1": "Property ownership is impressed with social function. Property use must not only be for the benefit of the owner but of society as well.",
									"enum2": "The State, in the promotion of social justice, may 'regulate the acquisition, ownership, use, enjoyment and disposition of private property, and equitably diffuse property ownership and profits.'",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								},
								{
									"name": "Ondoy vs. Ignacio",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "Social Justice in Labor Law",
									"enum1": "As between a laborer, usually poor and unlettered, and the employer, who has resources to secure able legal advice, the law has reason to demand from the latter stricter compliance. Social justice in these cases is not equality but protection.",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								},
								{
									"name": "Salonga vs. Farrales",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "Property Owners",
									"enum1": "Social justice cannot be invoked to trample on the rights of property owners who under our Constitution and laws are also entitled to protection.",
									"enum2": "The social justice consecrated in our constitution was not intended to take away rights from a person and give them to another who is not  entitled thereto. ",
									"enum3": "The plea for social justice cannot nullify the law on obligations and contracts. ",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								}
							]
						},
						{
							"name": "SECTION 11",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "The State values the dignity of every human person and guarantees full respect for human rights.",
							"children": [
								{
									"name": "Questions",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": [
										{
											"name": "What is the 1st case of Writ of Amparo?",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "Secretary of National Defense v. Manalo",
											"enum1": "",
											"enum2": "",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										},
										{
											"name": "From where did the writ of Amparo originate?",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "Mexico",
											"enum1": "",
											"enum2": "",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										},
										{
											"name": "What are the purposes of Amparo",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "",
											"enum1": "Amparo libertad for the protection of personal freedom equivalent to the habeas corpus writ;",
											"enum2": "Amparo contra leyes for the judicial review of the constitutionality of statutes;",
											"enum3": "Amparo casacion for the judicial review of the constitutionality and legality of a judicial decision;",
											"enum4": "Amparo administrativo for the judicial review of administrative actions;",
											"enum5": "Amparo agrario for the protection of peasants’ rights derived from the agrarian reform process.",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										}
									]
								},
								{
									"name": "Secretary of National Defense v. Manalo",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "Writ of Amparo - Palparan Case",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": [
										{
											"name": "Doctrine",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "While the right to life under Article III, Section 1 guarantees essentially the right to be alive - upon which the enjoyment of all other rights is preconditioned - the right to security of person is a guarantee of the secure quality of this life.",
											"enum1": "The life to which each person has a right is not a life lived in fear that his person and property may be unreasonably violated by a powerful ruler. Rather, it is a life lived with the assurance that the government he established and consented to, will protect the security of his person and property.",
											"enum2": "The right to security of person can exist independently of the right to liberty. There need not necessarily be a deprivation of liberty for the right to security of person to be invoked.",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										},
										{
											"name": "Right to Security of Person",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "The right to security of person is",
											"enum1": "(1) “Freedom from fear”;",
											"enum2": "(2) A guarantee of bodily and psychological integrity or security; and",
											"enum3": "(3) A guarantee of protection of one’s rights by the government.",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										}
									]
								}
							]
						},
						{
							"name": "SECTION 12",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "The State recognizes the sanctity of family life and shall protect and strengthen the family as a basic autonomous social institution. It shall equally protect the life of the mother and the life of the unborn from conception. The natural and primary right and duty of parents in the rearing of the youth for civic efficiency and the development of moral character shall receive the support of the Government.",
							"children": [
								{
									"name": "Questions",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": [
										{
											"name": "When does life begin?",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "Life begins at fertilization. Medical sources also support the view that conception begins at fertilization.",
											"enum1": "",
											"enum2": "",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										},
										{
											"name": "Meeting of sperm and egg, is that a human life?",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "46 chromosomes, which is origin in every human being, hence, it is considered as human life. But human life is different from civil personality.",
											"enum1": "",
											"enum2": "",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										}
									]
								},
								{
									"name": "Imbong vs. Ochoa",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "RH Law",
									"enum1": "Even if not formally established, the right to life, being grounded on natural law, is inherent and, therefore, not a creation of, or dependent upon a particular law, custom, or belief. It precedes and transcends any authority or the laws of men.",
									"enum2": " The State shall provide equal protection to both the mother and the unborn child from the earliest opportunity of life, that is, upon fertilization or upon the union of the male sperm and the female ovum.",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": [
										{
											"name": "Principle of Double-Effect",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "In a conflict situation between the life of the child and the life of the mother, the doctor is morally obliged always to try to save both lives. However, he can act in favor of one (not necessarily the mother) when it is medically impossible to save both, provided that no direct harm is intended to the other.",
											"enum1": "",
											"enum2": "",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										}
									]
								},
								{
									"name": "SPARK vs. Quezon City",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								},
								{
									"name": "Virtouso vs. Municipal Judge",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "Youthful Offender",
									"enum1": "A minor could be provisionally released on recognizance, in keeping with the constitutional mandate that 'the State recognizes the vital role of the youth in nation-building and shall promote their physical, intellectual, and social well-being.'",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								},
								{
									"name": "Obergefell vs. Hodges",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "Same-sex marriage",
									"enum1": "The history of marriage is one of both continuity and change. These new insights have strengthened, not weakened, the institution. Changed understandings of marriage are characteristic of a Nation where new dimensions of freedom become apparent to new generations.",
									"enum2": "The limitation of marriage to opposite-sex couples may long have seemed natural and just, but its inconsistency with the central meaning of the fundamental right to marry is now manifest.",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": [
										{
											"name": "Four Reasons why Marriage is a Fundamental Right under the Constitution",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "",
											"enum1": "(1) The right to personal choice regarding marriage is inherent in the concept of individual autonomy; ",
											"enum2": "(2) The right to marry is fundamental because it supports a two-person union unlike any other in its importance to the committed individuals;",
											"enum3": "(3) It safeguards children and families and thus draws meaning from related rights of childrearing, procreation, and education; and",
											"enum4": "(4) Marriage is a keystone of the Nation’s social order.",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										},
										{
											"name": "",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "",
											"enum1": "",
											"enum2": "",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										}
									]
								},
								{
									"name": "Falsis vs. Civil Registrar General",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								}
							]
						},
						{
							"name": "SECTION 16",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "The State shall protect and advance the right of the people to a balanced and healthful ecology in accord with the rhythm and harmony of nature.",
							"children": [
								{
									"name": "Oposa vs. Factoran",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "",
									"enum1": "Every generation has a responsibility to the next to preserve that rhythm and harmony for the full enjoyment of a balanced and healthful ecology.",
									"enum2": "The minors’ assertion of their right to a sound environment constitutes, at the same time, the performance of their obligation to ensure the  protection of that right for the generations to come.",
									"enum3": "These basic rights (to health and a balanced and healthful ecology) need not even be written in the Constitution for they are assumed to exist from the inception of humankind.",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								},
								{
									"name": "Laguna Lake Development Authority vs. CA",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "“Correlative Duty”",
									"enum1": "As a constitutionally guaranteed right of every person (right to a balanced and healthful ecology), it carries the correlative duty of nonimpairment.",
									"enum2": "It is a constitutional commonplace that the ordinary requirements of procedural due process yield to the necessities of protecting vital public interests through the exercise of police power.",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								}
							]
						},
						{
							"name": "SECTION 17",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "The State shall give priority to education, science and technology, arts, culture, and sports to foster patriotism and nationalism, accelerate social progress, and promote total human liberation and development.",
							"children": [
								{
									"name": "Guingona vs. Carague",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								}
							]
						},
						{
							"name": "SECTION 19",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "The State shall develop a self-reliant and independent national economy effectively controlled by Filipinos.",
							"children": [
								{
									"name": "Tanada v. Angara",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "WTO Agreement",
									"enum1": "While the Constitution indeed mandates a bias in favor of Filipino goods, services, labor and enterprises, at the same time, it recognizes the need for business exchange with the rest of the world on the bases of equality and reciprocity and limits protection of Filipino enterprises only against foreign competition and trade practices that are unfair. ",
									"enum2": "Economic self-reliance does not mean autarky or economic seclusion; rather, it means avoiding mendicancy in the international community.  Independence refers to the freedom from undue foreign control of the national economy, especially in such strategic industries as in the development of natural resources and public utilities.",
									"enum3": "It is to the credit of its drafters that a Constitution can withstand the assaults of bigots and infidels but at the same time bend with the refreshing winds of change necessitated by unfolding events.",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								},
								{
									"name": "Garcia vs. Board of Investments",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "Petrochemical Plant",
									"enum1": "Every provision of the Constitution on the national economy and patrimony is infused with the spirit of national interest. The nonalienation of natural resources, the State’s full control over the development and utilization of our scarce resources, agreements with foreigners being based on real contributions to the economic growth and general welfare of the country and the regulation of foreign investments in accordance with national goals and priorities are too explicit not to be noticed and understood.",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								}
							]
						},
						{
							"name": "SECTION 21",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "The State shall promote comprehensive rural development and agrarian reform.",
							"children": [
								{
									"name": "Association of Small Landowners in the Phils. vs. Sec. of DAR",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "Antaeus and Hercules",
									"enum1": "In the pursuit of agrarian reform, we do not tread on familiar ground but grope on terrain fraught with pitfalls and expected difficulties. The CARP Law is not a tried and tested project.",
									"enum2": "To use Justice Holmes’s words, “it is an experiment, as all life is an experiment,” and so we learn as we venture forward, and, if necessary, by  our own mistakes.”",
									"enum3": "The intention of the framers of the Constitution was to allow the payment of the balance (if the owner cannot be paid fully with money), or indeed of the entire amount of the just compensation, with other things of value.",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								},
								{
									"name": "Hacienda Luisita, Inc. vs. Presidential Agrarian Reform Council",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "Stock Distribution Plan",
									"enum1": "Agrarian reform is a perceived solution to social instability. The edicts of social justice found in the Constitution and the public policies that underwrite them, the extraordinary national experience, and the prevailing national consciousness, all command the great departments of government to tilt the balance in favor of the poor and underprivileged whenever reasonable doubt arises in the interpretation of the law.",
									"enum2": "The policy on agrarian reform is that control over the agricultural land must always be in the hands of the farmers.",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								}
							]
						},
						{
							"name": "SECTION 25",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "The State shall ensure the autonomy of local governments.",
							"children": [
								{
									"name": "Basco vs PAGCOR",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "Gambling",
									"enum1": "Being an instrumentality of the Government, PAGCOR should be and actually is exempt from local taxes.",
									"enum2": "Municipal corporations are mere creatures of Congress. If Congress can grant the City of Manila the power to tax certain matters, it can also provide for exemptions or even take back the power.",
									"enum3": "The power of local government to “impose taxes and fees” is always subject to “limitations” which Congress may provide by law.",
									"enum4": "The principle of local autonomy under the 1987 Constitution simply means “decentralization.” It does not make local governments sovereign within the state or an “imperium in imperio.”",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								},
								{
									"name": "Limbona vs. Mangelin",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "Autonomous Region",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": [
										{
											"name": "Decentralization of Administration",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "The central government delegates administrative powers to political subdivisions in order to broaden the base of government power. The President exercises “general supervision” over them, but only to “ensure that local affairs are administered according to law.” He has no control over their acts in the sense that he can substitute their judgments with his own.",
											"enum1": "",
											"enum2": "",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										},
										{
											"name": "Decentralization of Power",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "Involves an abdication of political power in the favor of local governments units declared to be autonomous. In that case, the autonomous government is free to chart its own destiny and shape its future with minimum intervention from central authorities.",
											"enum1": "",
											"enum2": "",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										}
									]
								}
							]
						},
						{
							"name": "SECTION 26",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "The State shall guarantee equal access to opportunities for public service, and prohibit political dynasties as may be defined by law.",
							"children": [
								{
									"name": "Pamatong vs. COMELEC",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "Nuisance Candidate",
									"enum1": "What is recognized is merely a privilege subject to limitations imposed by law. Section 26, Article II of the Constitution neither bestows such a right nor elevates the privilege to the level of an enforceable right.",
									"enum2": "The provision is not intended to compel the State to enact positive measures that would accommodate as many people as possible into public office.",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								}
							]
						},
						{
							"name": "SECTION 28",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"details": "Subject to reasonable conditions prescribed by law, the State adopts and implements a policy of full public disclosure of all its transactions involving public interest.",
							"children": [
								{
									"name": "Legaspi vs. Civil Service Commission",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "Eligibility Certificate",
									"enum1": "The authority to regulate the manner of examining public records does not carry with it the power to prohibit.",
									"enum2": "While the manner of examining public records may be subject to reasonable regulation by the government agency in custody thereof, the duty to disclose the information of public concern, and to afford access to public records cannot be discretionary on the part of said agencies. ",
									"enum3": "Public office being a public trust, it is the legitimate concern of citizens to ensure that government positions requiring civil service eligibility are occupied only by persons who are eligibles.",
									"enum4": "These constitutional provisions are self-executing. They supply the rules by means of which the right to information may be enjoyed.",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": [
										{
											"name": "Public concern",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "Public concern embraces a broad spectrum of subjects which the public may want to know, either because these directly affect their lives, or simply because such matters naturally arouse the interest of an ordinary citizen.",
											"enum1": "",
											"enum2": "",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										},
										{
											"name": "Availability of Access to Public Record",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "The availability of access to a particular public record must be circumscribed by the nature of the information sought, i.e.,",
											"enum1": "(1) being of public concern or one that involves public interest; and",
											"enum2": "(2) not being exempted by law from the operation of the constitutional guarantee.",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										}
									]
								},
								{
									"name": "Valmonte vs. Belmonte",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "GSIS Loans",
									"enum1": "a. The postulate of public office as a public trust, institutionalized in the Constitution to protect the people from abuse of governmental power, would certainly be mere empty words if access to such information of public concern is denied, except under limitations prescribed by implementing legislation adopted pursuant to the Constitution.",
									"enum2": "b. The right to information goes hand-in-hand with the constitutional policies of full public disclosure and honesty in the public service. It is meant to enhance the widening role of the citizenry in governmental decision-making as well as in checking abuse in government.",
									"enum3": "c. Although citizens are afforded the right to information and, pursuant thereto, are entitled to “access to official records,” the Constitution does not accord them a right to compel custodians of official records to prepare lists, abstracts, summaries and the like in their desire to acquire information on matters of public concern.",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								},
								{
									"name": "Aquino-Sarmiento vs. Morato",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "MTRCB Votes",
									"enum1": "a. The right to privacy belongs to the individual acting in his private capacity and not to a governmental agency or officers tasked with, and acting in, the discharge of public duties.  ",
									"enum2": "b. The voting slips are public records access to which is guaranteed to the citizenry. The constitutional recognition of the citizen’s right of access to official records cannot be made dependent upon the consent of the  members of the board concerned, otherwise, the said right would be rendered nugatory.  ",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								}
							]
						},
						{
							"name": "Other Provisions",
							"url": "",
							"facts": "",
							"issue": "",
							"ruling": "",
							"significance": "",
							"correlation": "",
							"details": "",
							"enum1": "",
							"enum2": "",
							"enum3": "",
							"enum4": "",
							"enum5": "",
							"enum6": "",
							"enum7": "",
							"enum8": "",
							"children": [
								{
									"name": "Section 7",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "The State shall pursue an independent foreign policy. In its relations with other states,  the paramount  consideration shall be national sovereignty, territorial integrity, national interest, and the right to self-determination. ",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								},
								{
									"name": "Section 8",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "The Philippines, consistent with the national interest, adopts and pursues a policy of freedom from nuclear weapons in its territory. ",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": [
										{
											"name": "Question",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "Supposing a law was enacted reviving the Bataan Nuclear Power Plant, would that violate the Constitution?",
											"enum1": "No, nuclear energy is not prohibited, only nuclear weapons.",
											"enum2": "",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										},
										{
											"name": "Question",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "Supposing the nuclear weapon is for defense of the territory, would that violate the constitution?",
											"enum1": "Yes, the Constitution provide that the Philippines pursues a policy of freedom from nuclear weapons in its territory.",
											"enum2": "",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										},
										{
											"name": "Question",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "What is the implication of this policy for the presence of American troops or for any American military base that might be established in the Philippines? ",
											"enum1": "Any new agreement on bases or the presence of troops, if ever there is one, must embody the basic policy of freedom from nuclear weapons. Moreover, it would be well within the power of government to demand ocular inspection and removal of nuclear arms ",
											"enum2": "",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										}
									]
								},
								{
									"name": "Section 9",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "The State shall promote a just and dynamic social order that will ensure the prosperity and independence of the nation and free the people from poverty through policies that provide adequate social services, promote full employment, a rising standard of living, and an improved quality of life for all.",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": [
										{
											"name": "Question",
											"url": "",
											"facts": "",
											"issue": "",
											"ruling": "",
											"significance": "",
											"correlation": "",
											"details": "Why should we promote a just and dynamic social order?",
											"enum1": "It is the foundation of a strong and prosperous nation. Poverty and injustice are the root causes of the public discontent which gives rise to chaos and disorder, and later, to a revolution.",
											"enum2": "Salus populi est supremalex: welfare of an individual yields to that of the community",
											"enum3": "",
											"enum4": "",
											"enum5": "",
											"enum6": "",
											"enum7": "",
											"enum8": "",
											"children": []
										}
									]
								},
								{
									"name": "Section 13",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "The State recognizes the vital role of the youth in nation-building and shall promote and protect their physical, moral, spiritual, intellectual, and social well-being. It shall inculcate in the youth patriotism and nationalism, and encourage their involvement in public and civic affairs.",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								},
								{
									"name": "Section 14",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "The State recognizes the role of women in nation-building, and shall ensure the fundamental equality before the law of women and men.",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								},
								{
									"name": "Section 15",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "The State shall protect and promote the right to health of the people and instill health consciousness among them.",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								},
								{
									"name": "Section 17",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "The State shall give priority to education, science and technology, arts, culture, and sports to foster patriotism and nationalism, accelerate social progress, and promote total human liberation and development.",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								},
								{
									"name": "Section 18",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "The State affirms labor as a primary social economic force. It shall protect the rights of workers and promote their welfare.",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								},
								{
									"name": "Section 20",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "The State recognizes the indispensable role of the private sector, encourages private enterprise, and provides incentives to needed investments.",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								},
								{
									"name": "Section 22",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "The State recognizes and promotes the rights of indigenous cultural communities within the framework of national unity and development.",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								},
								{
									"name": "Section 23",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "The State shall encourage non-governmental, community-based, or sectoral organizations that promote the welfare of the nation.",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								},
								{
									"name": "Section 24",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "The State recognizes the vital role of communication and information in nation-building.",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								},
								{
									"name": "Section 27",
									"url": "",
									"facts": "",
									"issue": "",
									"ruling": "",
									"significance": "",
									"correlation": "",
									"details": "The State shall maintain honesty and integrity in the public service and take positive and effective measures against graft and corruption.",
									"enum1": "",
									"enum2": "",
									"enum3": "",
									"enum4": "",
									"enum5": "",
									"enum6": "",
									"enum7": "",
									"enum8": "",
									"children": []
								}
							]
						}
					]
				}
			]
		},
		{
			"name": "Inherent Powers of the State",
			"url": "",
			"facts": "",
			"issue": "",
			"ruling": "",
			"significance": "",
			"correlation": "",
			"details": "",
			"enum1": "1) Police Power",
			"enum2": "2) Eminent Domain",
			"enum3": "3) Taxation",
			"enum4": "",
			"enum5": "",
			"enum6": "",
			"enum7": "",
			"enum8": "",
			"children": [
				{
					"name": "Police Power",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"details": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"children": []
				},
				{
					"name": "Eminent Domain",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"details": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"children": []
				},
				{
					"name": "Taxation",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"details": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"children": []
				}
			]
		},
		{
			"name": "Separation of Powers",
			"url": "",
			"facts": "",
			"issue": "",
			"ruling": "",
			"significance": "",
			"correlation": "",
			"details": "",
			"enum1": "",
			"enum2": "",
			"enum3": "",
			"enum4": "",
			"enum5": "",
			"enum6": "",
			"enum7": "",
			"enum8": "",
			"children": []
		},
		{
			"name": "Delegation of Power",
			"url": "",
			"facts": "",
			"issue": "",
			"ruling": "",
			"significance": "",
			"correlation": "",
			"details": "",
			"enum1": "",
			"enum2": "",
			"enum3": "",
			"enum4": "",
			"enum5": "",
			"enum6": "",
			"enum7": "",
			"enum8": "",
			"children": []
		},
		{
			"name": "Legislative Department",
			"url": "",
			"facts": "",
			"issue": "",
			"ruling": "",
			"significance": "",
			"correlation": "",
			"details": "",
			"enum1": "",
			"enum2": "",
			"enum3": "",
			"enum4": "",
			"enum5": "",
			"enum6": "",
			"enum7": "",
			"enum8": "",
			"children": []
		},
		{
			"name": "Executive Department",
			"url": "",
			"facts": "",
			"issue": "",
			"ruling": "",
			"significance": "",
			"correlation": "",
			"details": "",
			"enum1": "",
			"enum2": "",
			"enum3": "",
			"enum4": "",
			"enum5": "",
			"enum6": "",
			"enum7": "",
			"enum8": "",
			"children": []
		},
		{
			"name": "Judicial Department",
			"url": "",
			"facts": "",
			"issue": "",
			"ruling": "",
			"significance": "",
			"correlation": "",
			"details": "",
			"enum1": "",
			"enum2": "",
			"enum3": "",
			"enum4": "",
			"enum5": "",
			"enum6": "",
			"enum7": "",
			"enum8": "",
			"children": []
		},
		{
			"name": "Constitutional Commissions",
			"url": "",
			"facts": "",
			"issue": "",
			"ruling": "",
			"significance": "",
			"correlation": "",
			"details": "",
			"enum1": "",
			"enum2": "",
			"enum3": "",
			"enum4": "",
			"enum5": "",
			"enum6": "",
			"enum7": "",
			"enum8": "",
			"children": [
				{
					"name": "Common Provisions",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"details": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"children": []
				},
				{
					"name": "Civil Service Commission",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"details": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"children": []
				},
				{
					"name": "Commission on Elections",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"details": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"children": []
				},
				{
					"name": "Commission on Audit",
					"url": "",
					"facts": "",
					"issue": "",
					"ruling": "",
					"significance": "",
					"correlation": "",
					"details": "",
					"enum1": "",
					"enum2": "",
					"enum3": "",
					"enum4": "",
					"enum5": "",
					"enum6": "",
					"enum7": "",
					"enum8": "",
					"children": []
				}
			]
		},
		{
			"name": "Local Government",
			"url": "",
			"facts": "",
			"issue": "",
			"ruling": "",
			"significance": "",
			"correlation": "",
			"details": "",
			"enum1": "",
			"enum2": "",
			"enum3": "",
			"enum4": "",
			"enum5": "",
			"enum6": "",
			"enum7": "",
			"enum8": "",
			"children": []
		},
		{
			"name": "Article XI - Accountability of Public Officers",
			"url": "",
			"facts": "",
			"issue": "",
			"ruling": "",
			"significance": "",
			"correlation": "",
			"details": "",
			"enum1": "",
			"enum2": "",
			"enum3": "",
			"enum4": "",
			"enum5": "",
			"enum6": "",
			"enum7": "",
			"enum8": "",
			"children": []
		}
	]
}